Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/D08B.tmx
Source language: en_us
Languages: zh_cn

source: Colors of Religion: Christianity
zh_cn: 基督教的色彩

source: Christianity is a monotheistic religion centered on the life and teachings of Jesus of Nazareth.
zh_cn: 基督教是一种关注于生命及那撒勒基督训诫的一神论教。

source: They are named 'Christians' for their belief in Jesus Christ as the Son of God and the Messiah prophesied in the Old Testament, which is the first part of the Bible, and they see the New Testament, the second part, as the record of the Gospel that was revealed by Jesus.
zh_cn: 出于对上帝之子耶稣基督和圣经开卷部分《旧约》中所昭示的弥赛亚的笃信，那些人就被称为“基督徒”。作为圣经第二部分的《新约》，信徒视其为耶稣昭谕下福音书的记载。

source: Throughout the Christian Scriptures color is used in descriptions, and looking at the recurring themes supplies a better understanding and insight to the principles of the religion.
zh_cn: 在基督经文中，有关色彩的描述遍及全文上下，而回顾那些一再出现的主题也就能更好地理解宗教其本质，洞察其内涵。

source: Black has a powerful association with the negative aspects of human experience.
zh_cn: 黑色是和人类的厄运紧紧联系在一起的。

source: Death, plagues, famine, disease, mourning, and sorrow all fall under black in description, whether it be the encroaching pestilent clouds or the ruin left behind.
zh_cn: 无论是化作凛冽夺人的云团，抑或是毁灭之后的狼藉，死亡，瘟疫，饥馑，疾病，哀悼和悲伤等一切的一切皆是俯首于黑色的描述。

source: This is met with one exception pertaining to good health, which uses black to describe hair colour.
zh_cn: 只有一例幸免于健康：黑色在此以形容发色的乌亮。

source: Primarily, however, it is the colour of sin and judgment.
zh_cn: 然而，这个色彩主要仍代表罪恶和审判。

source: Perceived generally as a heavenly colour, blue is used throughout the Holy Scriptures.
zh_cn: 蓝色通常被看作天空之色，而在圣经中也可随处见其身影。

source: Representative of water, chastening, and holy service, the colour also appears in hanging decorations in holy places.
zh_cn: 除了表现水，惩戒和圣事，蓝色还出现在神地的壁饰中。

source: To say that it only refers to a few things is to limit it as a symbol, but blue seems to be the colour Christians use where Buddhists would use red.
zh_cn: 若说它只能涉及单单的几物，就未免将其局限于一种象征了。每每佛教徒选用红色，蓝色似乎就会是基督徒的选择。

source: Although there are a few occasions when it is used to describe corruption through wealth, it is usually purple that marks this.
zh_cn: 尽管蓝色也会在少数情况下来形容由财富产生的腐败，紫色才是通常所用的颜色。

source: The more obvious association for Green is with plant life like trees and grass, but it has come to represent rest, life, growth, that which is fruitful, freshness, maturity, and frailty.
zh_cn: 显然对于绿色，更多的联想是与如草木之类的植物联系而不可分。可是它也有其它的表意：生命，成长， 都可谓是充实而不乏生机，成熟与脆弱同行。

source: On a whole, it represents the triumph of life over death.
zh_cn: 总之，绿色传递出生命战胜死亡后的雄姿。

source: The exception to this association is when it is used to symbolize disease, which is made but twice in the same book.
zh_cn: 但是这点也有例外：在同一本书中，就有两处展现绿色曾用来表现疾病。

source: Grey is typically associated with old age and the beauty of it, but it can also mean weakness, purification, repentance, sorrow, and mourning.
zh_cn: 灰色一向是与老迈及其风度联系在一起的，然而它也会意味着虚弱，净化，忏悔，忧伤和哀悼。

source: It may also refer to ash, which on Ash Wednesday is placed on the forehead of a follower in the form of a cross to represent repentance during Lent, which is a forty-day period marked by fasting from both food and festivities, and other acts of penance.
zh_cn: 灰色同样可能指尘土。在为期四十天的斋戒，娱戒和其余赎罪的大斋期中的尘土星期三，信徒须在前额用灰色划一十字架，以示忏悔。

source: Orange, although more specifically Amber or Gold, is used to describe the overwhelming radiance and presence of God, but is also used to describe Jesus as the glory of God.
zh_cn: 虽然颇具琥珀和金色的意味，橘色却被用以形容万丈光芒和上帝的现身，但也会刻画上帝荣耀之中的耶稣。

source: Amber halos are seen around the heads of saints and Jesus Christ, and suggest a oneness with God and enlightenment.
zh_cn: 在圣人与耶稣基督的头上，我们可以看到琥珀色的光晕环绕其间， 这也昭示着他们与上帝同在和启蒙。

source: Vermillion is also used, which leans more toward a red-orange. It is seen in the paint of houses, but it has come to represent lust, corruption, and unrighteousness.
zh_cn: 同样会用到的是更接近于橘红的朱红， 我们在画中的房屋中可以看到这种色彩，然而它却后来被代表成色欲，腐败及不公。

source: Yellow is not common, but it is used to describe the colour of gold.
zh_cn: 黄色并不常见，但描绘黄金时却要用到。

source: It is later used to describe leprous hair.
zh_cn: 它在后来被用以形容麻风病人的发色。

source: As mentioned earlier, Purple is often associated with the corruption of wealth, and this is because to acquire purple dye meant spending a great deal of money.
zh_cn: 正如先前所提到的那样，紫色是与财富的腐败相联系， 这是因为要动用大量的金钱才能最后提炼出紫色的色调。

source: Often, it was only royalty that could afford to wear it.
zh_cn: 通常也只有皇室才能有实力穿紫衣。

source: In turn, it symbolises fine materials and hangings, like crimson.
zh_cn: 反之，它就用来代表精美的物品与挂飾，同深红相仿。

source: Purple has also been adopted as the colour for the periods of Lent and Advent.
zh_cn: 在大斋节和基督降临节期间，人们同样使用的是紫色。

source: Red has come to represent skin colour, wine, sores or plague, bloodied water, clothing, shields of might men, and temptation.
zh_cn: 红色代表肤色，葡萄酒，瘟疫溃烂的伤口，血水，服饰，战士的盔甲以及诱惑。

source: It also symbolizes the Pentecost, as it is the colour of fire.
zh_cn: 红色是火焰的颜色，所以它也象征着收获节。

source: The Pentecost is a great feast held fifteen days after Easter, which both historically and symbolically relates to the Jewish harvest festival of Shavuot, commemorating the descent of the Holy Spirit upon the Apostles and other followers of Jesus as described in the Book of Acts.
zh_cn: 收获节是继复活节后的为期半月的盛大节日，在历史上及象征意义上和五旬节中犹太人的收获节有关， 是纪念如《圣行书》中记载的圣灵降临至使徒及其他耶稣信徒之上的事件。

source: More specific than red, Crimson symbolizes life, as it is the colour of blood, but it also symbolizes war, sin, sacrifice, and the remission of sin.
zh_cn: 深红较红色更为特殊，是象征生命，因为它是鲜血的颜色；但是它也象征战争，罪恶，牺牲和恕罪。

source: It also appears when referring to fine materials, as the dye itself was extracted from the dried bodies of certain insects.
zh_cn: 由于深红的色道士从某些昆虫的干尸中萃取的，所以在涉及精美的物品时，红色也会提到。

source: It is also the colour used to describe the covenant, which is an agreement between God and his followers.
zh_cn: 它同样是用来形容上帝和信徒之间订立的圣约的颜色。

source: Scarlet represents purification and cleansing, but is also used in fine materials and riches.
zh_cn: 腓红的含义是涤罪和净化，但也会用在精美物品与富人中。

source: It is also used to describe Satan.
zh_cn: 用来形容撒旦的也是腓红。

source: White is used to represent purity, righteousness, things in nature, and a healthy body.
zh_cn: 白色代表着纯洁，公正，自然和健康的体魄。

source: It is also used to describe someone who is ill.
zh_cn: 病人也会用以白色形容。

source: It can be represented also by silver.
zh_cn: 银色和白色有着同样的代表含义。

source: Ivory, however, is used when referring to the material itself and the expense of it, as well as the time put into its ornate designs, such as an ivory through or archway.
zh_cn: 然而，象牙色却被用在物质本身和其花费。 随着时间的流逝，它用来表现其装饰性，例如象牙色的过道和拱门。

source: When used to describe the body, it symbolizes its beauty.
zh_cn: 当我们以象牙色形容身躯时，它象征的是人体之美。

source: Christianity's rainbow of symbolic colours dispels the typical fire and brimstone connotation.
zh_cn: 基督教中这些形形色色具象征意义的色彩剔除了火与硫黄的典型内涵。

source: From the fires of sacrifice to the white purity of thought, a Christian embraces all of the colors of life.
zh_cn: 从牺牲的火焰直至那思想的纯净，一位基督徒拥抱着生命之彩的所有。

source: Christian Holiday Colors
zh_cn: 基督教节日的色彩

source: One can argue that these are more of the "Commercialized" Christian Holiday Colors as both Christmas and Easter are now celebrated by Non-Christians alike, and are heavily marketed in retail stores.
zh_cn: 有人会质疑如今基督教节日色彩中的“商业”色彩日渐浓郁，因为圣诞节和复活节现在已为非基督徒庆祝，各种零售商品在大量充斥其间。

source: Christmas celebrates the birth of Jesus on December 24 & 25th.
zh_cn: 每年12月24日和25日的圣诞节是庆祝耶稣的诞生。

source: Christmas has become a large part of the western "Holiday Seasons" as Christmas Trees find their ways into many homes and families can be found caroling Christian songs in the streets.
zh_cn: 随着圣诞树进入千家万户，人们也会在街头聆听到圣诞歌曲，圣诞节已然成为西方的“假日季节”。

source: The iconic colors for Christmas are Red, Green, White & Gold.
zh_cn: 圣诞节中的明星色彩是红色，绿色，白色和金色。

source: Easter is an important day in the Christian Year.
zh_cn: 复活节在基督年中是具有举足轻重分量的一天。

source: It celebrates the resurrection of Jesus, which Christians believe occurred on the third day of his death.
zh_cn: 它是庆祝耶稣的复活，基督徒认为是在耶稣死后的第三天。

source: The holiday is observed between late March and Early April each year.
zh_cn: 节日是在每年的三月末至四月初 。

source: Easter is now commonly associated with the Easter Bunny, Dyed Eggs and bright colors of Pinks, Yellows, Blues, Greens, Purples.
zh_cn: 现在，复活节多半和复活兔，染色蛋和明亮的粉色，黄色，蓝色，绿色和紫色相关。
